ansewrsa = {

    'A1' : """

1) После того, как вы подошли столу необходимо правильно встать в стойку. Правильная стойка включает в себя такие аспекты как:

    1.1) Плечо должно находится в одной линией с кием;

    1.2) Предплечье с кием должны образовывать прямой угол;

    1.3) Ноги должны стоять максимально устойчиво, с равным распределением веса.

    
2)
    2.1) Кладём кий на линию удара.

    2.2) Ставим первую ногу под кий.
    
    2.3) Не двигая первой ногой, второй делаем шаг в противоположную сторону.

    2.4) Затем наклоняемся так, чтобы наш позвоночкник был в одну линию с кием.

    2.5) Вытягиваем свободную руку на стол и распологаем её в одну линию с основной конструкцией.

    2.6) Кий должен распологаться между большим и указательным пальцами, которые образуют мост.

    2.7) Убедитесь, что ваше тело находится в одной линии с кием. 

    2.8) Наносите удар!
        """,



    }