ansewrsa = {

    'A1' : """

1) После того, как вы подошли столу необходимо правильно встать в стойку. Правильная стойка включает в себя такие аспекты как:

    1.1) Плечо должно находится в одной линией с кием;

    1.2) Предплечье с кием должны образовывать прямой угол;

    1.3) Ноги должны стоять максимально устойчиво, с равным распределением веса.

    
2)
    2.1) Кладём кий на линию удара.

    2.2) Ставим первую ногу под кий.
    
    2.3) Не двигая первой ногой, второй делаем шаг в противоположную сторону.

    2.4) Затем наклоняемся так, чтобы наш позвоночкник был в одну линию с кием.

    2.5) Вытягиваем свободную руку на стол и распологаем её в одну линию с основной конструкцией.

    2.6) Кий должен распологаться между большим и указательным пальцами, которые образуют мост.

    2.7) Убедитесь, что ваше тело находится в одной линии с кием. 

    2.8) Наносите удар!
        """,

    'A2' : """

В бильярдном спорте очень важно контролировать силу для нанесения качественного и точного удара.
Сила измеряется по длинным бортам. Например:

    Если вы ударили шар и он прокатился один борт - это сила 1;

    Если прокатился 2 длинных борта (вернулся обратно к вам) - это сила 2;

    И так далее.

Чтобы тренировать силу удара:

    1) Выставите на котороткие борты по центру 2 шара с расстоянием друг от друга 5 шаров от центра.

    2) Попытка считается успешной, если вы ударили по шару и в конце своего пути он не откатился от короткого борта больше чем на четверть стола. 
    Пересечение границы шаром так же является ошибкой. Упражнение считается верно выполненным, если вы из 10-ти попыток совершили не более 2-ух ошибок.
        """,


    'A3' : """

Остановка - полное отсутствие винта, то есть после спорикосновения шаров "Свой" шар остаётся на месте. 

Чтобы выполнить этот удар:

    1) Поставьте прямую пару;

    2) Прицельтесь чуть ниже "Своего" шара;

    3) Сделайте акцентированный и чёткий, довольно сильный удар (сила 3).

        """,

    'A4' : """

Накат - верхний винт. После соприкосновения шаров, "Свой" шар идёт за "Чужим" шаром по одной линии.

Чтобы выполнить этот удар:

    1) Поставьте прямую пару;

    2) Прицельтесь на полторы наклейки выше центра;

    3) Сделайте акцентированный удар.
    
        """,

    'A5' : """

Оттяжка - нижний винт. После соприкосновения шаров "Свой" шар идёт в противоположную сторону от "Чужого" шара. 

Чтобы выполнить этот удар:

    1) Поставьте прямую пару;

    2) Прицельтесь на 2 наклейки ниже центра;

    3) Сделайте акцентированный удар с длинным проколом.

        """,

    'A6' : """
Упражнение по дальним своякам в русском бильярде заключается в том, чтобы улучшить точность удара и контроль над шаром при игре на расстоянии от бильярдного стола.


Начните с того, что поставьте шары на расстоянии от стола (обычно это 1-2 метра) и попробуйте попасть в целевой шар, при этом ставьте свою очередь наложенными руками на другой шар, чтобы снизить возможность случайного удара.


Сосредоточьтесь на том, чтобы выбрать правильное направление удара и точку на шаре, в которую нужно попасть. Помните, что нужно принимать во внимание такие факторы, как угол падения и отскока шара.


Попробуйте разные варианты удара - с разной силой удара и точностью. Поэкспериментируйте, чтобы понять, как влияет каждый из этих факторов на траекторию шара.


После каждого удара анализируйте результат и пытайтесь понять, что можно было бы улучшить в следующий раз.


Практикуйтесь регулярно, чтобы улучшить свои навыки и стать более точным игроком.


Запомните, что важно не только попасть в целевой шар, но и иметь чувство контроля над тем, каким образом это происходит. Упражнения по дальним своякам помогут вам развить эти навыки и стать более успешным игроком в русском бильярде.

        """,
    


    'A7' : """

Упражнение по забиванию свояков в центральную лузу в русском бильярде можно освоить в два этапа:


    На первом этапе нужно научиться визуально определять углы атаки. Для этого прицельный шар устанавливают недалеко от угловой лузы на расстоянии 20–30 см. От ближнего края лузы проводят визуальную линию, касательную к фронтальному краю прицельного шара, и на расстоянии примерно 80 см от точки касания устанавливают первый шар, но уже по другую сторону от касательной.


    На втором этапе при заданных углах атаки выполняют серию упражнений с определёнными параметрами удара. 
    Например, с увеличением угла атаки возрастают сила удара и резка по прицельному шару, а точка удара по битку смещается от положения ниже горизонтали вверх и в сторону, и на максимальных углах атаки располагается в центре битка.

        """,




    'A8' : """

Упражнение по своякам в угол в русском бильярде — это одно из базовых упражнений, которое помогает развивать точность удара и контроль над шаром. Чтобы выполнить это упражнение, следуйте этим шагам:

    1. Расположите шары в начальном положении: один шар выставите на основную точку (четвертую точку на короткой стороне стола), а второй шар упирайте в угол, образованный основной и центральной точкой на длинной стороне стола.

    2. Ударьте белый шар так, чтобы он коснулся первого шара и попал прямо в угол, где стоит второй шар.

    3. При выполнении упражнения обратите внимание на угол попадания белого шара в угол. Цель заключается в том, чтобы добиться максимальной точности.

    4. Повторяйте упражнение многократно, чтобы научиться контролировать удар и достигнуть стабильности в попаданиях.

Это упражнение поможет вам развить навыки точной работы с шарами и повысит ваш уровень мастерства в игре в русский бильярд. Практика и терпение помогут вам стать более опытным игроком.

""",
#  ЦЕНТР И УГОЛ У СВОИХ



    'A9' : """

Упражнение по резке в русском бильярде в центр – это то, что поможет улучшить навыки игры и повысить точность ударов. Для этого упражнения потребуется стандартная игровая комната с бильярдным столом и шариками.

    1. Расставьте шары в клетчатом порядке на бильярдном столе, оставив в центре стола один шар. Другие шары должны быть разбросаны по всему полю.

    2. Сфокусируйтесь на шаре в центре стола и попробуйте выполнить резки, чтобы забить разбросанные шары в лузы. Цель упражнения – сделать резку так, чтобы шары попадали в лузы как можно точнее.

    3. Попробуйте использовать различные углы резки, силу удара и столкновения с другими шарами, чтобы достичь максимальной точности и контроля над шарами.

    4. Постепенно увеличивайте сложность упражнения, добавляя больше шаров на поле или уменьшая расстояние между ними. Это поможет улучшить вашу технику и навыки в резке.

    5. Практикуйте регулярно и не забывайте отслеживать свой прогресс. Упражнение по резке в центре поможет вам стать более уверенным и мастером игры в русский бильярд.

        """,
# ЦЕНТР ЧУЖИЕ



    'A10' : """

Для выполнения упражнения по резке в русском бильярде в угол необходимо сначала правильно расположить шары. На столе должны находиться два шара: белый шар (кубок) и красный шар (бочонок). Белый шар размещается на некотором расстоянии от угла, а красный шар в углу стола.


Затем игрок должен нацелиться на красный шар и с помощью кия выполнить резку так, чтобы белый шар ударил по красному шару и после этого вернулся обратно в угол. Цель упражнения - научиться контролировать силу удара и точность попадания шаров.


Повторение этого упражнения поможет улучшить мастерство игрока в бильярде, улучшить координацию движений и научиться предвидеть траекторию шаров.

        """,

# УГОЛ ЧУЖИЕ



    'A11' : """

Отыгрыш от пирамиды - это техника игры в русский бильярд, при которой шары ударяются таким образом, чтобы они отскакивали от близко расположенной пирамиды и возвращались к исходной позиции. 


Для выполнения этого упражнения сначала нужно ударить шар так, чтобы он отскочил от пирамиды под углом приблизительно 45 градусов. Затем необходимо контролировать силу удара, чтобы шар вернулся обратно к исходной позиции. 


Отыгрыш от пирамиды представляет собой интересное и сложное упражнение, требующее от игрока хороших навыков владения кийом, контроля силы удара и понимания физики отскока шаров. Тренировка этой техники помогает улучшить мастерство и точность в игре в бильярд.


        """,

    }
